/**
 * @풀이
 *
 * DP
 *
 *
 * @처리순서 (피보나치 수열과 동일)
 *
 * 1. 각 칸까지 도달하는 방법의 수를 저장할 DP 배열 생성
 *
 * 2. DP[1] = 1로 초기화
 *
 * 3. DP[2] = 2로 초기화
 *
 * 4. 3부터 n까지 반복
 *
 * 5. 현재 칸에 도달하는 방법의 수를 계산
 *    -> 한 칸 전에서 1칸 이동
 *    -> 두 칸 전에서 2칸 이동
 *
 *    따라서
 *    DP[i] = DP[i - 1] + DP[i - 2]
 *
 * 6. 계산할 때마다 1234567로 나눈 나머지를 저장
 *    -> 숫자가 너무 커지는 것을 방지
 *
 * 7. DP[n] 반환
 *
 *
 * @시간복잡도
 *
 * O(N)
 *
 *
 * @공간복잡도
 *
 * O(N)
 *
 */

class Solution {

    public long solution(int n) {
        // 각 칸까지 도달하는 방법의 수를 저장할 배열
        long[] dp = new long[n + 1];

        // 초기값
        dp[1] = 1;
        dp[2] = 2;

        // 3부터 n까지 방법의 수 계산
        for (int i = 3; i <= n; i++) {
            // 한 칸 전에서 1칸 이동하거나
            // 두 칸 전에서 2칸 이동
            dp[i] = (dp[i - 1] + dp[i - 2]) % 1234567;
        }

        return dp[n];
    }
}
